gazetteerlist = {
    'COU': ['ரஷ்யா', 'பிரான்ஸ்', 'ஆஸ்திரியா-ஹங்கேரி', 'பல்கேரியா', 'ஐக்கிய அமெரிக்கா', 'இலங்கை',
                'இந்தியா', 'பிரித்தானியா', 'இத்தாலி', 'ஓட்டோமான்', 'ஜெர்மன்', 'ரோமானியா', 'ஜப்பான்',
                'போலாந்து', 'சீனா', 'அலுபேனியா', 'அங்கோலா', 'ஆஸ்திரேலியா', 'பகரைன்', 'பெல்சியம்',
            'பிரேசில்', 'கம்போடியா', 'கனடா', 'கியூபா', 'டென்மார்க்', 'எக்குவடோர்', 'எகிப்து', 'எல் சால்வடோர்',
            'இங்கிலாந்து', 'ஸ்வாசிலாந்து', 'பின்லாந்து', 'ஜோர்ஜியா', 'கானா', 'ஹாங்காங்', 'ஈரான்', 'ஈராக்',
            'அயர்லாந்து', 'ஜோர்டான்', 'கென்யா', 'கஜகஸ்தான்', 'கொரியா', 'குவைத்', 'லெபனான்',
            'லிதுவேனியா', 'மடகாஸ்கர்', 'மலேசியா', 'மொரிஷியஸ்', 'மெக்ஸிக்கோ', 'மால்டோவா', 'மொராக்கோ',
            'செக்கோஸ்லோவேகியா'],

    'CITY': ['கொழும்பு', 'ஹிரோசிமா', 'மஞ்சூரியா', 'அல்சேஸ்', 'லொரையின்', 'பரிஸ்'],

    'PER': ['நிக்கோலாஸ் II', 'அலெக்சேய் புருசிலோவ்', 'ஜார்ஜஸ் கிளெமென்சியு', 'ஜோசப் ஜோப்ரே', 'பேர்டினண்ட் ஃபோக்',
               'ராபர்ட் நிவேலே', 'பிலிப் பெட்டேன்', 'ஹெர்பேர்ட் எச். அஸ்குயித்', 'டே. லாயிட் ஜார்ஜ்', 'டக்ளஸ் ஹேக்',
               'ஜான் ஜெலிக்கோ', 'விக்டர் இம்மானுவேல் III', 'லுய்கி கடோர்னா', 'ஆர்மண்டோ டயஸ்', 'வூட்ரோ வில்சன்',
               'ஜான் பேர்ஷிங்', 'வின்ஸ்டன் சர்ச்சில்', 'பிராங்க்ளின் டெலானோ ரூஸ்வெல்ட்', 'பேரரசர் ஹிரோஹிட்டோ',
               'அடோல்ஃப் ஹிட்லர்', 'பெனிட்டோ முசோலினி', 'ஜோசப் ஸ்டாலின்', 'டக்ளஸ் மாக்ஆர்தர்', 'டுவைட் ஐசனோவர்',
               'மன்னர் ஜார்ஜ் V', 'ஆபிரகாம் டெர்பி', 'ஜார்ஜ் ஸ்டீபென்சன்', 'நியூகாமன்', 'ஜான் கே', 'ஜேம்சு ஆர்கிரீவ்ஸ்',
                'ராபர்ட் புல்டன்', 'மைக்கேல் பாரடே', 'ஹென்றி கார்ட்', 'ஜான் பிரின்ட்லி', 'ஜேம்ஸ் வாட்', 'எலி விட்னி',
                'ரிச்சர்ட் ஆர்க்ரைட்'],

    'MON': ['ஜனவரி', 'பெப்ரவரி', 'மார்ச்', 'ஏப்ரல்', 'மே', 'ஜூனஂ', 'ஜூலை', 'ஆகஸஂடஂ', 'செப்டெம்பர்', 'அக்டோபர்',
              'நவம்பர்', 'டிசம்பர்'],

    'GPE': ['ஐரோப்பியர்', 'பிரித்தானியர்', 'செக்கொஸ்லோவேக்கியர்', 'ஜேர்மனியினர்', 'எகிப்தியர்', 'ரஷ்யர்', 'யூதர்'],

    'CON': ['ஆசியா', 'ஆபிரிக்கா', 'வட அமெரிக்கா', 'தென் அமெரிக்கா', 'அன்டார்க்டிக்கா', 'ஐரோப்பா', 'ஆஸ்திரேலியா']
}

previousword = {
    'ORDINAL': ['முதலாவது', 'இரண்டாவது', 'மூன்றாவது', 'நான்காவது', 'ஐந்தாவது', 'ஆறாவது', 'ஏழாவது', 'எட்டாவது',
                'ஒன்பதாவது', 'பத்தாவது', 'முதலாம்', 'இரண்டாம்', 'மூன்றாம்', 'நான்காம்', 'ஐந்தாம்',
                'ஆறாம்', 'ஏழாம்', 'எட்டாம்', 'ஒன்பதாம்', 'பத்தாம்', 'பதினொன்றாம்', 'பன்னிரண்டாம்', 'பதின்மூன்றாம்',
                'பதிநான்காம்', 'பதினைந்தாம்', 'பதினாறாம்', 'பதினேழாம்', 'பதினெட்டாம்', 'பத்தொன்பதாம்', 'இருபதாம்',
                'ஒரு', 'இரு'],
    'LOC': ['வட', 'தென்', 'வடக்கு', 'கிழக்கு', 'தெற்கு', 'மேற்கு', 'வடகிழக்கு', 'வடமேற்கு', 'தென்மேற்கு', 'தென்கிழக்கு'],
    'COU': ['ஐக்கிய'],
    'ORG': ['சர்வதேச', 'தேசிய'],
    'TIME': ['கி.பி.', 'கி.மு.']
}

cluewords = {
    'CITY': ['பிரதேசம்', 'நகரம்', 'நகர்' 'தலைநகர்', 'ஊர்'],
    'COU': ['நாடு'],
    'CON': ['கண்டம்'],
    'PER': ['மன்னன்', 'மன்னர்', 'அரசன்', 'அரசர்', 'தலைவர்', 'ஜனாதிபதி', 'இராணுவ ஜெனரல்', 'இராணுவ வீரர்', 'தளபதி',
               'இளவரசன்', 'பேரரசன்', 'அமைச்சர்', 'பிரதமர்', 'சேனாதிபதி'],
    'ORG': ['திணைக்களம்', 'சங்கம்', 'அமைப்பு', 'கட்சி', 'சபை', 'அரசியல் கட்சி'],
    'YEAR': ['வருடம்', 'ஆண்டு'],
    'MON': ['மாதம்'],
    'DATE': ['திகதி', 'நாள்'],
    'TIME': ['நூற்றாண்டு', 'காலப்பகுதி', 'தொடக்கம்', 'முதல்', 'வரை'],
    'NUM': ['எண்ணிக்கை', 'பேர்'],
    'TRO': ['இராணுவம்'],
    'EVE': ['மகாயுத்தம்', 'சம்பவம்', 'நிகழ்வு', 'போர்', 'யுத்தம்'],
    'GPE': ['மக்கள்'],
    'GOV': ['அரசு', 'கூட்டரசு', 'பேரரசு'],
    'KIN': ['இராச்சியம்', 'ராஜ்யம்', 'இராஜ்யம்']
}

suffix = {
    "COU": ['லாந்து']
}

numbers = {
    'unit': ['ஒரு', 'இரு', 'ஒன்று', 'இரண்டு', 'மூன்று', 'நான்கு', 'ஐந்து', 'ஆறு', 'ஏழு', 'எட்டு', 'ஒன்பது', 'பத்து', 'பதினொன்று',
             'பன்னிரண்டு', 'பதின்மூன்று', 'பதினான்கு', 'பதினைந்து', 'பதினாறு', 'பதினேழு', 'பதினெட்டு', 'பத்தொன்பது'],
    'tens': ['இருபது', 'இருபத்து', 'முப்பது', 'முப்பத்து', 'நாற்பது', 'நாற்பத்து', 'ஐம்பது', 'ஐம்பத்து', 'அறுபது', 'அறுபத்து',
             'எழுபது', 'எழுபத்து', 'எண்பது', 'எண்பத்து', 'தொண்ணூறு', 'தொண்ணூற்று'],
    'hundred': ['நூறு', 'இருநூறு', 'முன்னூறு', 'நானூறு', 'ஐநூறு', 'அறுநூறு', 'எழுநூறு', 'எண்ணூறு', 'தொள்ளாயிரம்',
                'நூற்று', 'இருநூற்று', 'முன்னூற்று', 'நானூற்று', 'ஐநூற்று', 'அறுநூற்று', 'எழுநூற்று', 'எண்ணூற்று',
                'தொள்ளாயிரத்து'],
    'thousand': ['ஆயிரம்', 'ஆயிரத்து', 'இரண்டாயிரம்', 'மூலாயிரம்', 'நான்காயிரம்', 'ஐயாயிரம்', 'ஆறாயிரம்', 'ஏழாயிரம்',
                 'எண்ணாயிரம்', 'ஒன்பதாயிரம்'],
    'scales': ['இலட்சம்', 'கோடி', 'மில்லியன்', 'பில்லியன்']
}