gazetteerlist = {
    'country': ['ரஷ்யா', 'பிரான்ஸ்', 'ஆஸ்திரியா-ஹங்கேரி', 'பல்கேரியா', 'ஐக்கிய அமெரிக்கா', 'இலங்கை',
                'இந்தியா', 'பிரித்தானியா', 'இத்தாலி', 'ஓட்டோமான்', 'ஜெர்மன்', 'ரோமானியா', 'ஜப்பான்',
                'போலந்து', 'சீனா'],

    'city': ['கொழும்பு', 'ஹிரோசிமா', 'மஞ்சூரியா', 'அல்சேஸ்', 'லொரையின்', 'பரிஸ்'],

    'person': ['நிக்கோலாஸ் II', 'அலெக்சேய் புருசிலோவ்', 'ஜார்ஜஸ் கிளெமென்சியு', 'ஜோசப் ஜோப்ரே', 'பேர்டினண்ட் ஃபோக்',
               'ராபர்ட் நிவேலே', 'பிலிப் பெட்டேன்', 'ஹெர்பேர்ட் எச். அஸ்குயித்', 'டே. லாயிட் ஜார்ஜ்', 'டக்ளஸ் ஹேக்',
               'ஜான் ஜெலிக்கோ', 'விக்டர் இம்மானுவேல் III', 'லுய்கி கடோர்னா', 'ஆர்மண்டோ டயஸ்', 'வூட்ரோ வில்சன்',
               'ஜான் பேர்ஷிங்', 'வின்ஸ்டன் சர்ச்சில்', 'பிராங்க்ளின் டெலானோ ரூஸ்வெல்ட்', 'பேரரசர் ஹிரோஹிட்டோ',
               'அடோல்ஃப் ஹிட்லர்', 'பெனிட்டோ முசோலினி', 'ஜோசப் ஸ்டாலின்', 'டக்ளஸ் மாக்ஆர்தர்', 'டுவைட் ஐசனோவர்',
               'மன்னர் ஜார்ஜ் V'],

    'month': ['ஜனவரி', 'பெப்ரவரி', 'மார்ச்', 'ஏப்ரல்', 'மே', 'ஜூனஂ', 'ஜூலை', 'ஆகஸஂடஂ', 'செப்டெம்பர்', 'அக்டோபர்',
              'நவம்பர்', 'டிசம்பர்'],

    'gpe': ['ஐரோப்பியர்', 'பிரித்தானியர்', 'செக்கொஸ்லோவேக்கியர்', 'ஜேர்மனியினர்', 'எகிப்தியர்', 'ரஷ்யர்', 'யூதர்'],

    'continent': ['ஆசியா', 'ஆப்பிரிக்கா', 'வட அமெரிக்கா', 'தென் அமெரிக்கா', 'அன்டார்க்டிக்கா', 'ஐரோப்பா', 'ஆஸ்திரேலியா'],

}

previousword = {
    'ordinal': ['முதலாவது', 'இரண்டாவது', 'மூன்றாவது', 'நான்காவது', 'ஐந்தாவது', 'ஆறாவது', 'ஏழாவது', 'எட்டாவது',
                'ஒன்பதாவது', 'பத்தாவது', 'முதலாம்', 'இரண்டாம்', 'மூன்றாம்', 'நான்காம்', 'ஐந்தாம்',
                'ஆறாம்', 'ஏழாம்', 'எட்டாம்', 'ஒன்பதாம்', 'பத்தாம்', 'பதினொன்றாம்', 'பன்னிரண்டாம்', 'பதின்மூன்றாம்',
                'பதிநான்காம்', 'பதினைந்தாம்', 'பதினாறாம்', 'பதினேழாம்', 'பதினெட்டாம்', 'பத்தொன்பதாம்', 'இருபதாம்',
                'ஒரு', 'இரு'],
    'location': ['வட', 'தென்', 'வடக்கு', 'கிழக்கு', 'தெற்கு', 'மேற்கு', 'வடகிழக்கு', 'வடமேற்கு', 'தென்மேற்கு', 'தென்கிழக்கு'],
    'country': ['ஐக்கிய'],
    'org': ['சர்வதேச', 'தேசிய'],
    'time': ['கி.பி.', 'கி.மு.']
}

cluewords = {
    'city': ['பிரதேசம்', 'நகரம்', 'தலைநகர்', 'ஊர்'],
    'country': ['நாடு'],
    'continent': ['கண்டம்'],
    'person': ['மன்னன்', 'மன்னர்', 'அரசன்', 'அரசர்', 'தலைவர்', 'ஜனாதிபதி', 'இராணுவ ஜெனரல்', 'இராணுவ வீரர்', 'தளபதி',
               'இளவரசன்', 'பேரரசன்', 'அமைச்சர்', 'பிரதமர்', 'சேனாதிபதி'],
    'org': ['திணைக்களம்', 'சங்கம்', 'அமைப்பு', 'கட்சி', 'சபை', 'அரசியல் கட்சி'],
    'year': ['வருடம்', 'ஆண்டு'],
    'month': ['மாதம்'],
    'date': ['திகதி', 'நாள்'],
    'time': ['நூற்றாண்டு', 'காலப்பகுதி', 'தொடக்கம்', 'முதல்', 'வரை'],
    'quantity': ['எண்ணிக்கை', 'பேர்'],
    'troop': ['இராணுவம்'],
    'event': ['மகாயுத்தம்', 'சம்பவம்', 'நிகழ்வு', 'போர்', 'யுத்தம்'],
    'gpe': ['மக்கள்'],
    'gov': ['அரசு', 'கூட்டரசு', 'பேரரசு']
}

suffix = {
    "country": ['லாந்து']
}

numbers = {
    'unit': ['ஒரு', 'இரு', 'ஒன்று', 'இரண்டு', 'மூன்று', 'நான்கு', 'ஐந்து', 'ஆறு', 'ஏழு', 'எட்டு', 'ஒன்பது', 'பத்து', 'பதினொன்று',
             'பன்னிரண்டு', 'பதின்மூன்று', 'பதினான்கு', 'பதினைந்து', 'பதினாறு', 'பதினேழு', 'பதினெட்டு', 'பத்தொன்பது'],
    'tens': ['இருபது', 'இருபத்து', 'முப்பது', 'முப்பத்து', 'நாற்பது', 'நாற்பத்து', 'ஐம்பது', 'ஐம்பத்து', 'அறுபது', 'அறுபத்து',
             'எழுபது', 'எழுபத்து', 'எண்பது', 'எண்பத்து', 'தொண்ணூறு', 'தொண்ணூற்று'],
    'hundred': ['நூறு', 'இருநூறு', 'முன்னூறு', 'நானூறு', 'ஐநூறு', 'அறுநூறு', 'எழுநூறு', 'எண்ணூறு', 'தொள்ளாயிரம்',
                'நூற்று', 'இருநூற்று', 'முன்னூற்று', 'நானூற்று', 'ஐநூற்று', 'அறுநூற்று', 'எழுநூற்று', 'எண்ணூற்று',
                'தொள்ளாயிரத்து'],
    'thousand': ['ஆயிரம்', 'ஆயிரத்து', 'இரண்டாயிரம்', 'மூலாயிரம்', 'நான்காயிரம்', 'ஐயாயிரம்', 'ஆறாயிரம்', 'ஏழாயிரம்',
                 'எண்ணாயிரம்', 'ஒன்பதாயிரம்'],
    'scales': ['இலட்சம்', 'கோடி', 'மில்லியன்', 'பில்லியன்']
}