rules = {
    "COU": {
        "ஐ": "எந்த நாட்டை",
        "ஆல்": "எந்த நாட்டால்",
        "கு": "எந்த நாட்டுக்கு",
        "இல்": "எந்த நாட்டில்",
        "இன்": "எந்த நாட்டின்",
        "அது": "எந்த நாட்டினது",
        "None": "எந்த நாடு"

    },

    "CITY": {
        "ஐ": "எந்த நாட்டை",
        "ஆல்": "எந்த நாட்டால்",
        "கு": "எந்த நாட்டுக்கு",
        "இல்": "எந்த நாட்டில்",
        "இன்": "எந்த நாட்டின்",
        "அது": "எந்த நாட்டினது",
        "None": "எந்த நாடு"
    },

    "CON": {
        "ஐ": "எந்த கண்டத்தை",
        "ஆல்": "எந்த கண்டத்தால்",
        "கு": "எந்த கண்டத்துக்கு",
        "இல்": "எந்த கண்டத்தில்",
        "இன்": "எந்த கண்டத்தின்",
        "அது": "எந்த கண்டதஂதினது",
        "None": "எந்த கண்டம்"
    },

    "KIN": {
        "ஐ": "எந்த இராச்சியத்தை",
        "ஆல்": "எந்த இராச்சியத்தால்",
        "கு": "எந்த இராச்சியத்துக்கு",
        "இல்": "எந்த இராச்சியத்தில்",
        "இன்": "எந்த இராச்சியத்தின்",
        "அது": "எந்த இராச்சியத்தினது",
        "None": "எந்த இராச்சியம்"
    },

    "PER": {
        "ஐ": "யாரை",
        "ஆல்": "யாரால்",
        "கு": "யாருக்கு",
        "இல்": "யாரில்",
        "இன்": "யாரின்",
        "அது": "யாரது",
        "None": "யார்"
    },

    "EVE": {
        "ஐ": "எந்த நிகழ்வை",
        "ஆல்": "எந்த நிகழ்வால்",
        "கு": "எந்த நிகழ்வுக்கு",
        "இல்": "எந்த நிகழ்வில்",
        "இன்": "எந்த நிகழ்வின்",
        "அது": "எந்த நிகழ்வினது",
        "None": "எந்த நிகழ்வு"
    },

    "MON": {
        "இல்": "எந்த மாதத்தில்",
        "இன்": "எந்த மாதத்தின்",
        "None": "எந்த மாதம்"
    }

}












