rules = {
    "COU": {
        "ஐ": "எந்த நாட்டை",
        "ஆல்": "எந்த நாட்டால்",
        "கு": "எந்த நாட்டுக்கு",
        "இல்": "எந்த நாட்டில்",
        "இன்": "எந்த நாட்டின்",
        "அது": "எந்த நாட்டினது",
        "உம்": "எந்த நாடும்",
        "மீது": "எந்த நாட்டின்மீது",
        "உடன்": "எந்த நாட்டுடன்",
        "லிருந்து": "எந்த நாட்டிலிருந்து",
        "ஆகிய": "எந்த நாடு",
        "None": "எந்த நாடு"
    },

    "CITY": {
        "ஐ": "எந்த நகரத்தை",
        "ஆல்": "எந்த நகரத்தால்",
        "கு": "எந்த நகரத்துக்கு",
        "இல்": "எந்த நகரத்தில்",
        "இன்": "எந்த நகரத்தின்",
        "அது": "எந்த நகரத்தினது",
        "உம்": "எந்த நகரமும்",
        "மீது": "எந்த நகரத்தின்மீது",
        "உடன்": "எந்த நகரத்துடன்",
        "லிருந்து": "எந்த நகரத்திலிருந்து",
        "ஆகிய": "எந்த நகரம்",
        "None": "எந்த நகரம்"
    },



    "CON": {
        "ஐ": "எந்த கண்டத்தை",
        "ஆல்": "எந்த கண்டத்தால்",
        "கு": "எந்த கண்டத்துக்கு",
        "இல்": "எந்த கண்டத்தில்",
        "இன்": "எந்த கண்டத்தின்",
        "அது": "எந்த கண்டதஂதினது",
        "உம்": "எந்த கண்டமும்",
        "மீது": "எந்த கண்டத்தின்மீது",
        "உடன்": "எந்த கண்டதஂதுடன்",
        "லிருந்து": "எந்த கண்டத்திலிருந்து",
        "ஆகிய": "எந்த நகரம்",
        "None": "எந்த கண்டம்"
    },

    "KIN": {
        "ஐ": "எந்த இராச்சியத்தை",
        "ஆல்": "எந்த இராச்சியத்தால்",
        "கு": "எந்த இராச்சியத்துக்கு",
        "இல்": "எந்த இராச்சியத்தில்",
        "இன்": "எந்த இராச்சியத்தின்",
        "அது": "எந்த இராச்சியத்தினது",
        "உம்": "எந்த இராச்சியமும்",
        "மீது": "எந்த இராச்சியத்தின்மீது",
        "உடன்": "எந்த இராச்சியத்துடன்",
        "லிருந்து": "எந்த இராச்சியத்திலிருந்து",
        "ஆகிய": "எந்த இராச்சியம்",
        "None": "எந்த இராச்சியம்"
    },

    "PER": {
        "ஐ": "யாரை",
        "ஆல்": "யாரால்",
        "கு": "யாருக்கு",
        "இல்": "யாரில்",
        "இன்": "யாரின்",
        "அது": "யாரது",
        "உம்": "யாரும்",
        "மீது": "யாரின்மீது",
        "உடன்": "யாருடன்",
        "None": "யார்"
    },

    "EVE": {
        "ஐ": "எந்த நிகழ்வை",
        "ஆல்": "எந்த நிகழ்வால்",
        "கு": "எந்த நிகழ்வுக்கு",
        "இல்": "எந்த நிகழ்வில்",
        "இன்": "எந்த நிகழ்வின்",
        "அது": "எந்த நிகழ்வினது",
        "உம்": "எந்த நிகழ்வும்",
        "உடன்": "எந்த நிகழ்வுடன்",
        "ஆகிய": "எந்த நிகழ்வு",
        "None": "எந்த நிகழ்வு"
    },

    "MON": {
        "இல்": "எந்த மாதத்தில்",
        "இன்": "எந்த மாதத்தின்",
        "None": "எந்த மாதம்"
    },

    "TRO": {
        "ஐ": "எந்த இராணுவத்தை",
        "ஆல்": "எந்த இராணுவத்தால்",
        "கு": "எந்த இராணுவத்துக்கு",
        "இல்": "எந்த இராணுவத்தில்",
        "இன்": "எந்த இராணுவத்தின்",
        "அது": "எந்த இராணுவத்தினது",
        "உம்": "எந்த இராணுவமும்",
        "மீது": "எந்த இராணுவத்தின்மீது",
        "உடன்": "எந்த இராணுவத்துடன்",
        "லிருந்து": "எந்த இராணுவத்திலிருந்து",
        "ஆகிய": "எந்த இராணுவம்",
        "None": "எந்த இராணுவம்"
    },

    "ORG": {
        "கட்சி": {
            "ஐ": "எந்த கட்சியை ",
            "ஆல்": "எந்த கட்சியால்",
            "கு": "எந்த கட்சிக்கு",
            "இல்": "எந்த கட்சியில்",
            "இன்": "எந்த கட்சியின்",
            "அது": "எந்த கட்சியினது",
            "உம்": "எந்த கட்சியும்",
            "மீது": "எந்த கட்சியின்மீது",
            "உடன்": "எந்த கட்சியுடன்",
            "லிருந்து": "எந்த கட்சியிலிருந்து",
            "ஆகிய": "எந்த கட்சி",
            "None": "எந்த கட்சி"
        },
        "சபை": {
            "ஐ": "எந்த சபையை",
            "ஆல்": "எந்த சபையால்",
            "கு": "எந்த சபைக்கு",
            "இல்": "எந்த சபையில்",
            "இன்": "எந்த சபையின்",
            "அது": "எந்த சபையினது",
            "உம்": "எந்த சபையும்",
            "மீது": "எந்த சபையின்மீது",
            "உடன்": "எந்த சபையுடன்",
            "லிருந்து": "எந்த சபையிலிருந்து",
            "ஆகிய": "எந்த சபை",
            "None": "எந்த சபை"
        }

    }
}












